readme.org
* The Basics
** Global Variables
We can define global variables with =DEFPARAMETER= and =DEFVAR=. =DEFPARAMETER= will always bind the supplied value, while =DEFVAR= will only bind a value to a variable if no binding exists.

#+begin_src lisp

  ;; Establish an unbound variable
  
  (defvar *x*)
  
  ;; Assign the value 15 to X
  
  (defparameter *x* 15)
  
  ;; Does nothing as X already bound
  
  (defvar *x* 10)

#+end_src

We can define global constants with =DEFCONSTANT=:

#+begin_src lisp

 (defconstant +my-constant+ 20)

#+end_src

** Global Functions
Global functions are defined with =DEFUN= using the below syntax.

#+begin_src lisp

  (defun function-name (parameter*)
    "Optional documentation string."
    body-form*)

#+end_src

Below is example of a function that multiplies the sum of two numbers by 10.

#+begin_src lisp

  (defun multiply-sum-by-10 (x y)
    "Returns the sum of two numbers multiplied by 10"
    (* 10 (+ x y)))

  ;; Returns 150

  (multiply-sum-by-10 5 10)

#+end_src

** Assignment

=SETF= is LISP's general purpose assignment operator. It is a powerful setter that can assign values to many different types of places.

The syntax of =SETF= is as follows.  Places are typically either symbols, representing variables or functions, or getter forms that access particular places in objects that we wish to modify.

#+begin_src lisp

  (setf place value)

#+end_src

Below are some examples.

#+begin_src lisp

  ;; Set x to 10

  (setf x 10)

  ;; Set x to 1 and y to 2

  (setf x 1 y 2)

  ;; Example of using a getter with setf
  
  (defvar *list* '(1 2 3 4))
  
  (setf (car *list*) 5)
  
  ;; Returns (5 2 3 4)
  
  *list*

#+end_src

** Input & Output

The LISP reader consists of three primary functions

- The function =READ= is used to parse input into Lisp objects and reads exactly one expression, regardless of newlines

- The function =READ-LINE= reads all characters up to a newline, returning a string

- The function =READ-FROM-STRING= takes a string and returns the first
  expression from it

Below are some examples you can experiment with.

#+begin_src lisp

  (defparameter my-variable nil)

  (setf my-variable (read-line))

  (setf my-variable (read))

  (setf my-variable (read-from-string "(1 2 3)"))

#+end_src

The most useful LISP printing functions are:

- =PRINT= and =PRIN1= are used to generate output useful for programs (the former adds a newline to the output whilst the latter does not)

- =PRINC= is used for output for people

- =FORMAT= is a highly configurable printer and the most commonly used printer

The syntax of =FORMAT= is as follows:

#+BEGIN_SRC lisp

  (format destination control-string optional-arguments*)
  
#+END_SRC

The first argument of the =FORMAT= function is the destination where the output will be printed.

- A value of =T= will send the out to the stream =*​STANDARD-OUTPUT​*= (typically the main screen of your LISP system) whilst =NIL= here will return the output as a string. We can also supply a stream here 
- The second argument is the string that we want to print. However, we can enter directives (preceded by =~=) to add complex behaviour to the string, such as
  - =~%= to print newlines
  - =~A= to print LISP objects for humans
  - =~S= to print LISP objects for computers, i.e. suitable as as input for the LISP reader
 
The third (optional) argument of the =FORMAT= function is the arguments we want to supply to the control string. Each =~A= or =~S= in the control-string takes a successive argument from here and places it into the string.

This is best illustrated by the following examples. Note how Bob is quoted in the second example, as the printed representation of LISP strings includes quotes.

#+begin_src lisp

  ;; Prints to screen: Dear Bob, How are you?

  (format t "Dear ~A, ~% How are you?" "Bob")

  ;; Prints to screen: Dear "Bob", How are you?

  (format t "Dear ~S, How are you?" "Bob")

  ;; Returns "Number is: 3" (a string)

  (format nil "~A ~A" "Number is:" (+ 1 2))

#+end_src

** Numerical Functions
Basic numerical functions include =+=, =*=, =-=, =/=. They can take more than two operands.

#+begin_src lisp

  ;; Returns 20

  (+ 4 7 9)

#+end_src

Numerical comparisons can be achieved with ~=~, =/== (not equal to), =>=, =<=, =>== and =<==. With three or more arguments, these functions act as range checks.

For example, the below returns true as X is between 0 and 5 inclusive.

#+begin_src lisp

  (defparameter x 5)
  
  (<= 0 x 5)

#+end_src

The below returns false as X > Y:

#+begin_src lisp

  (defparameter y 4)
  
  (< 0 x y 6)

#+end_src

The below returns true as Y < X < 6:

#+begin_src lisp

  (< 0 y x 6)

#+end_src

Other useful numerical functions are below. 

#+begin_src lisp

  ;; Returns e^3

  (exp 3)

  ;; Returns 4^5

  (expt 4 5)

  ;; Returns log of 8 in the base 2, i.e. 3

  (log 8 2)

  ;; Returns square root of 9, i.e. 3

  (sqrt 9)

  ;; Returns 5

  (max 1 3 5 4 2)

  ;; Returns -1

  (min 1 -1 2 3 4)

  ;; Returns 3

  (abs -3)

#+end_src

More details on numerical operations can be found in [[https://www.cs.cmu.edu/Groups/AI/html/cltl/clm/node121.html][Common Lisp, the Language 2nd Edition]].

** Text Functions
=CONCATENATE= is a useful function to join strings. Try the following:

#+begin_src lisp

(concatenate 'string "Hello, " "world" ". Today is good.")

#+end_src

=LENGTH= returns the number of characters in a string. The below will return 6:

#+begin_src lisp

  (length "Common")

#+end_src

=SEARCH= will search for a substring within a string. The below will return 4, the starting position of the first string within the second string:

#+begin_src lisp

  (search "term" "the term is search within this string")

#+end_src

Below are comparison functions for strings. Replace STRING with CHAR in the below to get the equivalent character comparison function. 

| Case Sensitive | Case Insensitive    |
|----------------+---------------------|
| STRING=        | STRING-EQUAL        |
| STRING/=       | STRING-NOT-EQUAL    |
| STRING<        | STRING-LESSP        |
| STRING<=       | STRING-NOT-GREATERP |
| STRING>        | STRING-GREATERP     |
| STRING>=       | STRING-NOT-LESSP    |

* Logic & Equality
** Type Predicates
Common Lisp has a type hierarchy and LISP objects can belong to multiple data types.
One can test whether an object is of a particular type with =TYPEP=. The below will return true:

#+begin_src lisp

 (typep "My String" 'string)

#+end_src

Other type predicate functions include ATOM, NULL, ZEROP, NUMBERP, EVENP, LISTP, ARRAYP, PLUSP, CHARACTERP, ODDP, SYMBOLP, PACKAGEP, MINUSP, STRINGP and ODDP.

** Boolean & Logic
Falsity is represted by =NIL= and all other values represent truth.

The function =AND= returns =NIL= if any of its arguments are false and returns the value of the last argument if all arguments are true. The below will return 5 as all the arguments are true:

#+begin_src lisp

(and t (+ 1 2) (* 1 5))

#+end_src

The function =OR= returns the first argument that is true and =NIL= if no argument is true. The below returns 3, the first non-nil value in the form:

#+begin_src lisp
 
  (or nil (+ 1 2) (* 1 5))

#+end_src

