README.md
# The Common Lisp Cheat Sheet

1. [The Basics](#org77d32bb)
   1. [Global Variables](#org7babf58)
   2. [Global Functions](#org7561355)
   3. [Assignment](#orgaf86fa8)
   4. [Input & Output](#orgd660dc0)
   5. [Numerical Functions](#org14d1d98)
   6. [Text Functions](#org509a49b)
2. [Logic & Equality](#orgbb85d6f)
   1. [Type Predicates](#org3d5c207)
   2. [Boolean & Logic](#org2ea5239)
   3. [Equality](#org95cc4a3)
   4. [Blocks](#orgf591e22)
   5. [Conditionals](#org3a0d565)
3. [Looping](#orge0a634f)
   1. [Basic Looping](#org436ea7c)
   2. [Advanced Looping](#org83b693d)
4. [Local Variables & Functions](#org92b85fc)
   1. [Local Variables](#org9f76fb8)
   2. [Local Functions](#org9b010ba)
5. [More on Functions](#org283acf2)
   1. [Lambda Expressions](#orgfceb856)
   2. [Function Parameters](#org7a4f5d3)
   3. [Multiple Values](#org86b4d87)
   4. [Apply & Funcall](#orgc982106)
   5. [Mapping Functions](#orgc1e2096)
6. [More on Lists](#org721d229)
   1. [List Functions](#org681ae0f)
   2. [Push, Pop & Reverse](#orgc1be892)
   3. [Association Lists](#org34d47a7)
7. [More on Sequences](#org4faae7d)
   1. [Arrays](#org6377bc9)
   2. [Sequence Functions](#org469c85e)
   3. [Keyword Arguments](#org5e7bf39)
8. [Data Structures](#org94ffa30)
   1. [Hash Tables](#orgb7bdb2a)
   2. [Structures](#orge20b38c)
   3. [Common Lisp Object System (CLOS)](#orgab67257)
9. [Other](#orge334e2e)
   1. [Reading & Writing to Files](#org5926aaf)
   2. [Packages](#orgc750fcf)


<a id="org77d32bb"></a>

# The Basics


<a id="org7babf58"></a>

## Global Variables

We can define global variables with `DEFPARAMETER` and `DEFVAR`. `DEFPARAMETER` will always bind the supplied value, while `DEFVAR` will only bind a value to a variable if no binding exists.

```lisp

;; Establish an unbound variable

(defvar *x*)

;; Assign the value 15 to X

(defparameter *x* 15)

;; Does nothing as X already bound

(defvar *x* 10)

```

We can define global constants with `DEFCONSTANT`:

```lisp

(defconstant +my-constant+ 20)

```


<a id="org7561355"></a>

## Global Functions

Global functions are defined with `DEFUN` using the below syntax.

```lisp

(defun function-name (parameter*)
  "Optional documentation string."
  body-form*)

```

Below is example of a function that multiplies the sum of two numbers by 10.

```lisp

(defun multiply-sum-by-10 (x y)
  "Returns the sum of two numbers multiplied by 10"
  (* 10 (+ x y)))

;; Returns 150

(multiply-sum-by-10 5 10)

```


<a id="orgaf86fa8"></a>

## Assignment

`SETF` is LISP's general purpose assignment operator. It is a powerful setter that can assign values to many different types of places.

The syntax of `SETF` is as follows. Places are typically either symbols, representing variables or functions, or getter forms that access particular places in objects that we wish to modify.

```lisp

(setf place value)

```

Below are some examples.

```lisp

;; Set x to 10

(setf x 10)

;; Set x to 1 and y to 2

(setf x 1 y 2)

;; Example of using a getter with setf

(defvar *list* '(1 2 3 4))

(setf (car *list*) 5)

;; Returns (5 2 3 4)

*list*

```


<a id="orgd660dc0"></a>

## Input & Output

The LISP reader consists of three primary functions

-   The function `READ` is used to parse input into Lisp objects and reads exactly one expression, regardless of newlines

-   The function `READ-LINE` reads all characters up to a newline, returning a string

-   The function `READ-FROM-STRING` takes a string and returns the first expression from it

Below are some examples you can experiment with.

```lisp

(defparameter my-variable nil)

(setf my-variable (read-line))

(setf my-variable (read))

(setf my-variable (read-from-string "(1 2 3)"))

```

The most useful LISP printing functions are:

-   `PRINT` and `PRIN1` are used to generate output useful for programs (the former adds a newline to the output whilst the latter does not)

-   `PRINC` is used for output for people

-   `FORMAT` is a highly configurable printer and the most commonly used printer

The syntax of `FORMAT` is as follows:

```lisp

(format destination control-string optional-arguments*)

```

The first argument of the `FORMAT` function is the destination where the output will be printed.

-   A value of `T` will send the out to the stream `*​STANDARD-OUTPUT​*` (typically the main screen of your LISP system) whilst `NIL` here will return the output as a string. We can also supply a stream here
-   The second argument is the string that we want to print. However, we can enter directives (preceded by `~`) to add complex behaviour to the string, such as
    -   `~%` to print newlines
    -   `~A` to print LISP objects for humans
    -   `~S` to print LISP objects for computers, i.e. suitable as as input for the LISP reader

The third (optional) argument of the `FORMAT` function is the arguments we want to supply to the control string. Each `~A` or `~S` in the control-string takes a successive argument from here and places it into the string.

This is best illustrated by the following examples. Note how Bob is quoted in the second example, as the printed representation of LISP strings includes quotes.

```lisp

;; Prints to screen: Dear Bob, How are you?

(format t "Dear ~A, ~% How are you?" "Bob")

;; Prints to screen: Dear "Bob", How are you?

(format t "Dear ~S, How are you?" "Bob")

;; Returns "Number is: 3" (a string)

(format nil "~A ~A" "Number is:" (+ 1 2))

```


<a id="org14d1d98"></a>

## Numerical Functions

Basic numerical functions include `+`, `*`, `-`, `/`. They can take more than two operands.

```lisp

;; Returns 20

(+ 4 7 9)

```

Numerical comparisons can be achieved with `=`, `/=` (not equal to), `>`, `<`, `>=` and `<=`. With three or more arguments, these functions act as range checks.

For example, the below returns true as X is between 0 and 5 inclusive.

```lisp

(defparameter x 5)

(<= 0 x 5)

```

The below returns false as X > Y:

```lisp

(defparameter y 4)

(< 0 x y 6)

```

The below returns true as Y < X < 6:

```lisp

(< 0 y x 6)

```

Other useful numerical functions are below.

```lisp

;; Returns e^3

(exp 3)

;; Returns 4^5

(expt 4 5)

;; Returns log of 8 in the base 2, i.e. 3

(log 8 2)

;; Returns square root of 9, i.e. 3

(sqrt 9)

;; Returns 5

(max 1 3 5 4 2)

;; Returns -1

(min 1 -1 2 3 4)

;; Returns 3

(abs -3)

```

More details on numerical operations can be found in [Common Lisp, the Language 2nd Edition](https://www.cs.cmu.edu/Groups/AI/html/cltl/clm/node121.html).


<a id="org509a49b"></a>

## Text Functions

`CONCATENATE` is a useful function to join strings. Try the following:

```lisp

(concatenate 'string "Hello, " "world" ". Today is good.")

```

`LENGTH` returns the number of characters in a string. The below will return 6:

```lisp

(length "Common")

```

`SEARCH` will search for a substring within a string. The below will return 4, the starting position of the first string within the second string:

```lisp

(search "term" "the term is search within this string")

```

Below are comparison functions for strings. Replace STRING with CHAR in the below to get the equivalent character comparison function.

| Case Sensitive | Case Insensitive    |
|-------------- |------------------- |
| STRING=        | STRING-EQUAL        |
| STRING/=       | STRING-NOT-EQUAL    |
| STRING<        | STRING-LESSP        |
| STRING<=       | STRING-NOT-GREATERP |
| STRING>        | STRING-GREATERP     |
| STRING>=       | STRING-NOT-LESSP    |


<a id="orgbb85d6f"></a>

# Logic & Equality


<a id="org3d5c207"></a>

## Type Predicates

Common Lisp has a type hierarchy and LISP objects can belong to multiple data types. One can test whether an object is of a particular type with `TYPEP`. The below will return true:

```lisp

(typep "My String" 'string)

```

Other type predicate functions include ATOM, NULL, ZEROP, NUMBERP, EVENP, LISTP, ARRAYP, PLUSP, CHARACTERP, ODDP, SYMBOLP, PACKAGEP, MINUSP, STRINGP and ODDP.


<a id="org2ea5239"></a>

## Boolean & Logic

Falsity is represted by `NIL` and all other values represent truth.

The function `AND` returns `NIL` if any of its arguments are false and returns the value of the last argument if all arguments are true. The below will return 5 as all the arguments are true:

```lisp

(and t (+ 1 2) (* 1 5))

```

The function `OR` returns the first argument that is true and `NIL` if no argument is true. The below returns 3, the first non-nil value in the form:

```lisp

(or nil (+ 1 2) (* 1 5))

```
