readme.org
** Equality
Common Lisp has a few different functions for testing equality of two objects. Generally speaking, you can't go wrong with =EQUAL=

- =EQ= compares equality of memory addresses and is the fastest test. It is useful to compare symbols quickly and to test whether two cons cells are physically the same object. It should not be used to compare numbers

- =EQL= is like =EQ= except that it can safely compare numbers for numerical equality and type equality. It is the default equality test in many Common Lisp functions

- =EQUAL= is a general purpose test that, in addition to being able to safely compare numbers like =EQL=, can safely compare lists on an element by element basis. Lists are not unique and =EQ= and =EQL= will fail to return equality on equivalent lists if they are stored in different memory addresses

- =EQUALP= is a more liberal version of =EQUAL=. It ignores case distinctions in strings, among other things

- ~=~ is the most efficient way to compare numbers, and the only way to compare numbers of disparate types, such as 3 and 3.0. It only accepts numbers

** Blocks
The =PROGN= form allows multiple forms to be evaluated and the value of the last is returned as the value of the =PROGN=. The below will print "Hello" and "World" and return 10:

#+begin_src lisp

  (progn
    (print "Hello")
    (print "World")
    (+ 5 5))

#+end_src

The =BLOCK= special operator is similar, but it is named and has a mechanism for out-of-order exit with the =RETURN-FROM= operator.

- The value of the last expression in a block is returned as the value of the block (unless there is an early exit by =RETURN= or =RETURN-FROM=)
- All other expressions in the block are thus only useful for their side effects

The below constructs a block named MY-BLOCK and returns 10 as it returns from the block when evaluating the =RETURN-FROM= form:

#+begin_src lisp
 
  (block my-block
    (print "We see this")
    (return-from my-block 10)
    (print "We will never see this"))

#+end_src

The =RETURN= macro returns its argument as the value of an enclosing =BLOCK= named =NIL=.  Many Common Lisp operators that take a body of expressions implicitly enclose the body in a =BLOCK= named =NIL= and we can use =RETURN= in these forms:

 #+begin_src lisp
   
   (dolist (i '(1 2 3 5 6 7))
     (if (= i 3)
	 (return 10))
     (print i))

 #+end_src

** Conditionals
The five main conditionals in Common Lisp are =IF=, =WHEN=, =UNLESS=, =COND= and =CASE=.

Example of =IF= form (note there is *no* implicit =PROGN=):

#+begin_src lisp

  (if (equal 5 (+ 1 4))
      (print "This is true")
      (print "This if false"))

#+end_src

Example of =WHEN= form (note there is an implicit =PROGN=):

#+begin_src lisp

  (when (equal 5 (+ 1 4))
    (print "Print if statement is true")
    (print "Print this also"))

#+end_src

Example of =UNLESS= form (note there is an implicit =PROGN=):

#+begin_src lisp

  (unless (equal 3 (+ 1 4))
    (print "Only print if condition is false")
    (print "Print this also"))

#+end_src

Example of =COND= form (multiple ifs, implicit =PROGN=). The form exits on the first true:
	
#+begin_src lisp

  (cond ((equal 5 3) (print "This will not print"))
	((equal 5 5) (print "This will print"))
	((equal 5 5)
	 (print "This will not print as the")
	 (print "form exited at first true")))

#+end_src

Example of a =CASE= form (multiple ifs on one variable, implicit =PROGN=). Cases are literal and not evaluated. The form exits on the first true:

#+begin_src lisp

  ;; Try entering in 9 and then (* 3 3) at the read prompt. Then try entering 0
  
  (case (read)
     ((1 3 5 7 9 (* 3 3)) "Odd")
    (* 3 3)
    (0 ; Note implicit PROGN here
     (print "Zero")
     (print "Number"))
    (otherwise "Not a odd number < 10"))

#+end_src

* Looping
** Basic Looping
=DOLIST= will iterate over the items of a list and execute the loop body for each item of the list.

#+begin_src lisp

  (dolist (my-variable my-list optional-result-form)
    body-form*)

#+end_src

Below is an example that will print the numbers 1 to 7 iteratively:

#+begin_src lisp

   (dolist (i '(1 2 3 5 6 7))
     (print i))

#+end_src

=DOTIMES= will iterate from 0 to one less than the end number supplied. If an optional result form is supplied, it will be evaluated at the end of the loop. 

#+begin_src lisp

  (dotimes (my-variable end-number optional-result-form)
    body-form*)

#+end_src

Below is an example that will print the numbers 0 to 4:

#+begin_src lisp

  (dotimes (i 5 T)
    (print i))

#+end_src

** Advanced Looping
Below is the syntax of the =DO= macro. 
#+begin_src lisp

  (do ((var1 init1 step1)
       ...
       (varn initn stepn))
      (end-test result-forms*)
    body-forms*)

#+end_src

The below example will return 81 and print 1, 0, 1, 4, 9, 16, 25, 36, 49 and 64 on newlines. During each iteration, LOOP-STEP is increased by one and SQUARE is set to the square of LOOP-STEP:

#+begin_src lisp

  (do ((loop-step 0 (+ loop-step 1))
       (square 1 (* loop-step loop-step)))
      ((= 10 loop-step) square) ; Stop at 10
    (print square)) ; Print square at each step

#+end_src

Below are examples of the =LOOP= macro, some from [[http://www.ai.sri.com/pkarp/loop.html][Peter D. Karp's Guide]]. The first will return a list of the doubles of each number in the original list:

#+begin_src lisp

  (defvar my-list-1 '(1 2 3 4 5 6))

  ;; Returns (2 4 6 8 10 12)
  
  (loop for x in my-list-1
	collect (+ x x))

#+end_src

The below will print each of the numbers in the list iteratively:

#+begin_src lisp

 (loop for x in my-list-1
	do (print x))

#+end_src

The below will only collect even numbers:

#+begin_src lisp

  (loop for x in my-list-1
	if (evenp x)
	collect x)

#+end_src

The below is an example of iterating across two lists, stopping the loop at the end of the shorter list:

#+begin_src lisp

  (defvar my-list-2 '(a b c d e))
  
  (loop for x in my-list-1
	for y in my-list-2
	do (format t "X: ~a, Y: ~a, " x y))

#+end_src

We can also do simple loops with a counter:

#+begin_src lisp

 (loop for x from 1 to 5
	do (print x))

#+end_src

Below is an example of how we can use the =LOOP= macro to check whether a certain predicate is true at some point within a list:

#+begin_src lisp

(loop for x in '(abc 2) 
      thereis (numberp x))

#+end_src

We can also check whether a predicate is never true within a loop:

#+begin_src lisp

(loop for x in '(abc 2) 
      never (numberp x))

#+end_src

We can also check whether a predicate is always true within a loop:

#+begin_src lisp

(loop for x in '(abc 2)
	always (numberp x))

#+end_src

Below is an example of terminating a loop early:

 #+begin_src lisp

(loop for x from 1
      for y = (* x 10)
      while (< y 100)
      do (print (* x 5))
      collect y)

 #+end_src

Finally, a few more examples illustrating the versatility of the =LOOP= macro:

#+begin_src common-lisp

  (loop for x in '(a b c d e 1 2 3 4)
	until (numberp x)
	do
	collect (list x 'abc))

  (loop for x in '(a b c d e)
	for y from 1
	when (> y 1) do (format t ", ")
	do (format t "~A" x))

  (loop for x in '(a b c d e)
      for y from 1
      if (> y 1)
      do (format t ", ~A" x)
      else do (format t "~A" x))
  
#+end_src

* Local Variables & Functions
** Local Variables

=LET= and =LET*= are special operators that allow us to create local variables that can only be accessed within their closures. =LET= binds its variables in parallel such that you cannot refer to another variable in the =LET= form when setting the value of another. =LET*= binds its variables in sequentially, so that you can refer to the value of any previously bound variables. This is useful when you want to assign names to several intermediate steps in a long computation.

The =LET= form has the following syntax:

#+begin_src elisp

  (let ((var-1 value-1)
	...
	(var-n value-n))
    body-form*)

#+end_src

Below is an example of =LET*= that will return 10:

 #+begin_src lisp

   ;; Prints 10
   
   (let* ((x 5)
	  (y (+ x x)))
     (print y))

 #+end_src

