README.md


<a id="org9b010ba"></a>

## Local Functions

Functions named by `DEFUN` are global functions that can be accessed anywhere. We can define local functions `LABELS`, which are only accessible within their context. The syntax of `LABELS` is:

```lisp

(labels ((fn-1 args-1 body-1)
	 ...
	 (fn-n args-n body-n))
  body-form*)

```

Functions defined within `LABELS` take a similar format to a `DEFUN` form. Within the body of the `LABELS` form, function names matching those defined by the `LABELS` refer to the locally defined functions rather than any global functions with the same names.

Below is an example of a `LABELS` form that will return 12, the result of (+ 2 4 6), where 2, 4 and 6 are the results of evaluating the three local functions defined in the form.

```lisp

(labels ((first-function (x) (+ x x))
	 (second-function (y) (* y y))
	 (third-function (z) (first-function z)))
  (+ (first-function 1)
     (second-function 2)
     (third-function 3))) 

```


<a id="org283acf2"></a>

# More on Functions


<a id="orgfceb856"></a>

## Lambda Expressions

Lambda expressions allow us to create unnamed functions. These are useful when writing small functions for certain tasks. Below is an example that returns 101:

```lisp

((lambda (x)
   (+ x 100))
 1)

```


<a id="org7a4f5d3"></a>

## Function Parameters

By default, a function call must supply values for all parameters that feature in the function definition. We can modify this behaviour with the `&optional`, `&key` and `&rest` tokens.

The `&optional` token allows us to distinguish between required parameters, placed before the `&optional` token, and optional parameters, placed after the token:

```lisp

(defun make-a-list (a b c d &optional e f g)
  (list a b c d e f g))


;; Returns (1 2 3 4 5 NIL NIL)

(make-a-list 1 2 3 4 5)

```

One drawback of the `&optional` token, using the above as an example, is that we need to supply values for E and F if we want to supply the value for G, as arguments in a function call are assigned to the parameters in order.

To overcome this, we utilise the `&key` token to be able to specify which optional parameter we want to assign a value to. Below is an example of this.

```lisp

(defun make-a-list-2 (a b c d &key (e 1) f g)
  (list a b c d e f g))


;; Returns (1 2 3 4 1 NIL 7)

(make-a-list-2 1 2 3 4 :g 7)

```

In general, `&key` is preferable to `&optional` as it allows us to have greater control in our function calls. It also makes code easier to maintain and evolve as we can add new parameters to a function without affecting existing function calls (useful when writing libraries that are already dependencies for other programs).

Finally, the `&rest` token, placed before the last variable in a parameter list, allows us to write functions that can accept an unknown number of arguments. The last variable will be set to a list of all the remaining arguments supplied by the function call:

```lisp

(defun make-a-list-3 (a b c d &rest e) (list a b c d e))

(make-a-list-3 1 2 3 4 5 6 7 8) ; (1 2 3 4 (5 6 7 8))

```

We can utilise multiple tokens in the same function call, as long as we declare them in order:

1.  First the names of required parameters are declared
2.  Then the `&optional` parameters
3.  Then the `&rest` parameter
4.  Finally the `&keyword` parameters are declared


<a id="org86b4d87"></a>

## Multiple Values

The `VALUES` function returns multiple values and can be used as the last expression in the body of a function. The below example returns 1, NIL and 6 (individually, not as a list):

```lisp

(values 1 nil (+ 2 4))

```

If a `VALUES` function is supplied as an argument to a form which is only expecting one value, the first value returned by the `VALUES` function is used and the rest are discarded:

```lisp

;; Returns 6

(+ 5 (values 1 nil (+ 2 4)))

```

The `MULTIPLE-VALUE-BIND` macro is used to receive multiple values. The first argument of this macro is a list of parameters and the second is an expression whose values are bound to the parameters. We can then use these bindings in the body of the `MULTIPLE-VALUE-BIND` macro.

Below is an example that returns (1 2 3):

```lisp

(multiple-value-bind (x y z) (values 1 2 3)
   (list x y z)) 

```

If there are more variables than values, the leftover variables will be bound to NIL. If there are more values than variables, the extra values will be discarded.


<a id="orgc982106"></a>

## Apply & Funcall

Functions in LISP are first-class objects that generally support all operations available to other data objects, such as being modified, passed as an argument, returned from a function and being assigned to a variable.

The `FUNCTION` special operator (shorthand `#'`) returns the function object associated with the name of function that is supplied as an argument:

```lisp

(function +)

;; Equivalent syntax

#'+

```

`APPLY` takes a function and a list of arguments for it and returns the result of applying the function to its arguments.

Below is an example that returns 6. Note how we have to use to sharp-quote `#'` to pass the `+` function as an object into the `APPLY` function. Without doing so, LISP will return an error as it will try to evaluate `+`, which is not legally permissible in the below example.

```lisp

(apply #'+ '(1 2 3))

```

The below is an example that illustrates the use of lambda expressions:

```lisp

(apply #'(lambda (a b c)
	   (+ a b c))
       '(1 2 3))

```

The function `FUNCALL` is similar to `APPLY`, but allows us to pass arguments individually and not as a list. Below is an example that returns 6:

```lisp

(funcall #'+ 1 2 3)

```


<a id="orgc1e2096"></a>

## Mapping Functions

Mapping is a type of iteration in which a function is successively applied to pieces of one or more sequences.

`MAPCAR` operates on successive elements of lists and returns a list of the result of the successive calls to the function specified. The below example will return (-1 -2 -3):

```lisp

(mapcar #'(lambda (x) (- 0 x)) '(1 2 3))

```

`MAPLIST` operates on successive CDRs of the lists. The below example will return ((A B C D) (B C D) (C D) (D)):

```lisp

(maplist #'(lambda (x) x) '(a b c d))

```

The above only work for lists. To map over other types of sequences, one can use `MAP`:

```lisp

(map result-type function &rest sequences)

```

Below are a couple of examples.

```lisp

;; Returns a list ((#\a #\a) (#\b #\b) (#\c #\c))

(map 'list #'(lambda (x) (list x x)) "abc")

;; Returns "1010"

(map 'string
     #'(lambda (x) (if (oddp x) #\1 #\0))
     '(1 2 3 4))


```
