README.md


<a id="org469c85e"></a>

## Sequence Functions

Sequences have many useful functions. We can use `LENGTH` to return the number of items in a sequence. The below returns 6:

```lisp

(length '(a b c d e f))

```

`REMOVE` and its variants are very handy filter functions. The below returns (C R T) as a new list:

```lisp

(remove 'a '(c a r a t))

```

The below returns "cdbra", preserving only the last duplicate of each item:

```lisp

(remove-duplicates "abracadabra")

```

The below returns (2 4 4) by removing all odd numbers:

```lisp

(remove-if #'oddp '(1 2 3 4 4))

```

`SUBSEQ` can extract a portion of a sequence. Its arguments are a list, the starting position and an optional ending position (which is not to be included in the subsequence). The below will return (B C D):

```lisp

(subseq '(a b c d e f) 1 4)

```

`SORT` takes a sequence and a comparison function of two arguments and destructively (i.e. by modifying the original sequence) returns a sequence sorted according to the function. The below returns (6 5 4 2 1) by sorting in descending order:

```lisp

(sort '(1 4 2 5 6) #'>)

```

The functions `EVERY` and `SOME` test whether a sequence satisfies a provided predicate. The below will return NIL as not every item is odd:

```lisp

(every #'oddp '( 1 2 5))

```

The below will return T as some of the items are odd:

```lisp

(some #'oddp '( 1 2 5))

```

The below will return T as the items of the first sequence are greater than those of the second sequence in an element-wise comparison:

```lisp

(every #'> '(1 3 5) '(0 2 4))

```

We can find elements within a sequence with `FIND`, which returns the leftmost such element, or `POSITION`, which returns the position of such an item, as an integer. The below returns 1, the item we are searching for:

```lisp

(find 1 '(1 2 3 4))

```

The below returns 0, the position of the item we are searching for:

```lisp

(position 1 '(1 2 3 4))

```

We can use `COUNT` to count the number of instances of the element within the sequence. The below returns 3, the number of instances of 1 in the list:

```lisp

(count 1 '(1 2 3 1 1 4))

```

We can use `SEARCH` to search for sequence within another. The below returns 4, the position of the string "Hello" in "Hi! Hello, World!":

```lisp

(search "Hello" "Hi! Hello, World!")

```


<a id="org5e7bf39"></a>

## Keyword Arguments

Many list and sequence functions take one or more keyword arguments from the below table. For example, we can use `POSITION` to return the position of an element within a sequenc (or NIL if not found) and use keyword arguments to determine where to begin the search.

The below will return 4:

```lisp

(position #\a "fantasia" :start 3 :end 7)

```

| Parameter | Position                            | Default  |
|--------- |----------------------------------- |-------- |
| :key      | A function to apply to each element | identity |
| :test     | The test function for comparison    | eql      |
| :from-end | If true, work backwards             | nil      |
| :start    | Position at which to start          | 0        |
| :end      | Position, if any, at which to stop  | nil      |


<a id="org94ffa30"></a>

# Data Structures


<a id="orgb7bdb2a"></a>

## Hash Tables

A hash table is a way of associating pairs of objects, like a dictionary. The objects stored in a hash table or used as keys can be of any type. We can make hastables with `MAKE-HASH-TABLE` and retrieve values associated with a given key with `GETHASH`:

```lisp

(defparameter my-hash-table (make-hash-table))

;; Returns NIL as not yet set

(gethash 'color my-hash-table) 

```

Similar to other structures, we use `SETF` to set values. Hash tables can accommodate any number of elements, because they are expanded when they run out of space.

```lisp

(setf (gethash 'color my-hash-table) 'red)  

```

The function `MAPHASH` allows you to iterate over all entries in the hash table.

-   Its first argument must be a function which accepts two arguments, the key and the value of each entry
-   Note that due to the nature of hash tables you can't control the order in which the entries are provided to `MAPHASH` (or other traversing constructs)

Below is an example, which will return COLOR = RED as there is only one item (COLOR) currently in our hash table.

```lisp

(maphash #'(lambda (key value)
	     (format t "~A = ~A~%" key value))
	 my-hash-table)

```

You can remove items from a hash table with `REMHASH`:

```lisp

(remhash 'color my-hash-table)

```


<a id="orge20b38c"></a>

## Structures

Common Lisp provides the `DEFSTRUCT` facility for creating data structures with named components. This makes it easier to manipulate custom data objects as we can refer to their components by name.

Constructor, access and assignment constructs are automatically defined when a data type is defined through `DEFSTRUCT`. Consider the below example of defining a data type for rectangles.

`DEFSTRUCT` defines RECTANGLE to be a structure with two fields, HEIGHT and WIDTH. The symbol RECTANGLE becomes the name of a data type and each rectangle will be of type RECTANGLE, then STRUCTURE, then ATOM and then T.

`DEFSTRUCT` will generate four associated functions:

1.  RECTANGLE-HEIGHT and RECTANGLE-WIDTH to access elements of the structure

2.  RECTANGLE-P to test whether an object is of type RECTANGLE

3.  MAKE-RECTANGLE to create rectangles

4.  COPY-RECTANGLE to create copies of rectangles

Below is an example of the above structure.

```lisp

;; Height will default to NIL while width will default to 5 

(defstruct rectangle
  (height)
  (width 5))

```

The below creates an instance of RECTANGLE:

```lisp

(defvar rectangle-1)

(setf rectangle-1
      (make-rectangle :height 10 :width 15))

```

The below will return 10:

```lisp

(rectangle-height rectangle-1)

```

The below will set RECTANGLE-WIDTH of RECTANGLE-1 to 20:

```lisp

(setf (rectangle-width rectangle-1) 20)

```
