readme.org
** Common Lisp Object System (CLOS)
Below is an example of creating two classes, one which inherits from the other. Courtesy of the [[https://lispcookbook.github.io/cl-cookbook/clos.html][Common Lisp Cookbook]].

#+begin_src lisp

  ;; Define a class:
    
  (defclass person ()
   ((name
    :initarg :name
    :accessor name)
   (lisper
    :initform "Yes"
    :accessor lisper)))

  ;; Create an instance of this class:

  (defvar person-1
    (make-instance 'person :name "David" ))

#+end_src

Accessor functions are used for both getting and setting. The below will return DAVID.

#+begin_src lisp

  (name person-1)
  
#+end_src

The below will set name to TOM.

#+begin_src lisp

  (setf (name person-1) "Tom")
  
#+end_src

=:INITFORM= is used to set default values. The below returns "Yes" (the default value) as the value of LISPER was not yet set.

#+begin_src lisp

  (lisper person-1)
  
#+end_src

The below is an example of inheriting from the PERSON class.

#+begin_src lisp

  (defclass child (person)
    ((can-walk-p
     :initarg :can-walk-p
     :initform "No"
     :accessor can-walk-p)))

#+end_src

Inherited classes inherit the slots of their parents. CHILD will inherit LISPER from PERSON. The below will return "Yes":

#+begin_src lisp

 (lisper (make-instance 'child :name "Phoebe"))

#+end_src

Inherited classes can also introduce new slots. CHILD introduces CAN-WLAK-P. The below will return "No":

#+begin_src lisp

  (can-walk-p (make-instance 'child))
  
#+end_src

We can add methods to classes with a combination of =DEFGENERIC= and =DEFMETHOD=. Note that Common Lisp supports multiple dispatch so that many classes can share and use the same method names.

=DEFGENERIC= establishes an entry in the method dispatch table, while =DEFMETHOD= allows us to create specialised versions.

#+begin_src lisp

  ;; Version with a default method (to be used if no other specialisations exist:

  (defgeneric greet (obj)
    (:documentation "Says hi")
    (:method (obj)
	     (format t "Hi")))

  ;; Version without default method:

  (defgeneric greet-2 (obj1 obj2)
    (:documentation "Says hi"))
    
#+end_src

In creating specialised methods, we add the parameter type to the parameter list. In a method call, LISP will then use the method which matches the parameter types of the parameters supplied in the method call.

In the below, GUEST-NAME is a parameter of type PERSON, while MESSAGE is a parameter that is not specialised and can be anything.

#+begin_src lisp

  (defmethod greet-2 ((guest-name person) message)
    (format t "The person greets ~A and says ~A" guest-name message))

#+end_src

Finally, it is useful to create custom print output for CLOS objects. This can be achieved with the following.

#+begin_src lisp

  (defmethod print-object ((obj person) stream)
  (print-unreadable-object (obj stream :type t)
			   (format stream "~a" (name obj))))

;; Returns #<Person Tom>
  
  (print person-1)

#+end_src

* Other
** Reading & Writing to Files

The =WITH-OPEN-FILE= macro is used to read and write to files. Below is an example of opening a file and then reading from it. The =NIL= in the below inhibits end of file errors.

#+begin_src lisp

  (with-open-file (my-stream "/Users/ashokkhanna/test.txt")
    (format t "~a~%" (read-line my-stream nil)))

#+end_src

Below is an example of opening a file and then writing to it.

#+begin_src lisp

  (with-open-file (my-stream "/Users/ashokkhanna/test.txt" :direction
			     :output :if-exists :append)
    (format my-stream "~a~%" "Hello, World!"))

#+end_src

The following open arguments can be supplied to the =WITH-OPEN-FILE= macro:

| Arguments                  | Effect                             |
|----------------------------+------------------------------------|
| :direction :output         | Write to a file insead of reading  |
| :if-does-not-exist :create | Create a file if it does not exist |
| :if-exists :supersede      | Replace the file that exists       |
| :if-exists :overwrite      | Overwrite file                     |
| :if-exists :append         | Write to end of file               |

** Packages

Packages are a central mechanism for avoiding name collisions that occur if multiple files contain variables or functions with the same name. More information on packages can be found on [[https://ashok-khanna.medium.com/an-introduction-to-lisp-packages-7a9ee352006e][my guide on Medium]].

Packages need to be registered before they can be used. Below is an example of registering a package that inherits from two packages and exports two symbols. This example also shadows two symbols,  allowing us to use, within MY-PACKAGE, the definitions of these symbols (RESTART and CONDITION in our case) that exist within the package MY-PACKAGE and not definitions of these symbols inherited from other packages (CL in our case, where RESTART and CONDITION are interned also).

#+begin_src lisp

  (defpackage :my-package
    (:use :cl :other-package-1)
    (:export :symbol-1
	     :restart)
    (:shadow :restart
	     :condition))

#+end_src

Once a package is registered with the above, we can switch to it with =IN-PACKAGE=.

- *Within a package*, all symbols defined in that package are accessible. In addition, any exported symbols from packages inherited via the =:USE= command can be directly accessed without a package qualifier

- *Outside of a package*, internal symbols can be accessed via a double-colon package qualifier, e.g. =my-package::symbol-3=, while exported symbols can be accessed via a single-colon package qualifier, e.g. =my-package:symbol-1=

It is good practice to put the above at the top of LISP files so that readers can easily follow which package is currently live in a file.

#+begin_src lisp

  (in-package :my-package)
  
#+end_src

Finally, note in the above, that we will get an error if we try to inherit from both CL and MY-PACKAGE due to to the clash in symbols RESTART and CONDITION that appear in both packages. To overcome this, we can use a =:shading-import-from:= command, such as in the following.

#+begin_src lisp

  (defpackage :my-package-2
    (:use :cl :my-package)
    (:shadowing-import-from :my-package :restart))

#+end_src
